app/Controllers/Category.php

SELECT *
FROM `category`
ORDER BY `categoryId` DESC
---
    public function viewCategory()
    {
        $model = new CategoryModel();
        $data['category'] = $model->orderBy('categoryId', "ASC")->findAll();