app/Controllers/Officer.php

    public function viewOfficer()
    {
        $model = new OfficerModel();
        $data['officer'] = $model->orderBy('offId', "DESC")->findAll();
---
SELECT *
FROM `officer`
ORDER BY `offId` DESC

    public function getOfficerById($id = null)
    {
        $model = new OfficerModel();
        $data = $model->where('offId', $id)->first();
---
SELECT *
FROM `officer`
WHERE `offId` = '3'
 LIMIT 1

    public function addOfficer()
    {
        $model = new OfficerModel();
        $data = [
            'offId' => $this->request->getVar('offId'),
            'FName' => $this->request->getVar('FName'),
            'LName' => $this->request->getVar('LName'),
            'userName' => $this->request->getVar('userName'),
            'password' => $this->request->getVar('password'),
            'gender' => $this->request->getVar('gender'),
            'offImage' => $this->request->getVar('offImage'),
            'phoneNumber' => $this->request->getVar('phoneNumber'),
        ];
        $model->insert($data);
---
INSERT INTO `officer` (`offId`, `FName`, `LName`, `userName`, `password`, `gender`, `offImage`, `phoneNumber`) VALUES ('', 'Nuttaphon', 'S.', 'Nut', '123456', 'ชาย', 'รูป', '0801912652')