app/Controllers/Post.php

SELECT *
FROM `post`
ORDER BY `postId` DESC
---
    public function viewPost()
    {
        $model = new PostModel();
        $data['post'] = $model->orderBy('postId', "DESC")->findAll();