app/Models/OfficerModel.php

    public function register($data)
    {
        $this->save($data);
---
INSERT INTO `officer` (`userName`, `password`, `FName`, `LName`, `gender`, `phoneNumber`, `offImage`) VALUES ('Yannasit2', '$2y$10$z20S1moBfla0aBihgJqUau3cX5xzpdJPsFuMtZ2NG60U7KxrcA92G', 'Yannasit', 'Santiekachun', 'ชาย', '0801912652', '-')