app/Models/PostModel.php

    public function viewPost()
    {
        $data = $this->orderBy('postId', "DESC")->findAll();
---
SELECT *
FROM `post`
ORDER BY `postId` DESC

    public function getPostById($id)
    {
        $data = $this->where('postId', $id)->first();
---
SELECT *
FROM `post`
WHERE `postId` IS NULL
 LIMIT 1