app/Models/UserModel.php

SELECT *
FROM `users`
ORDER BY `userId` ASC
---
    public function viewUser()
    {
        $data = $this->orderBy('userId', "ASC")->findAll();

SELECT *
FROM `users`
WHERE `userId` = '31'
---
    public function viewUser2($id)
    {
        $data = $this->where('userId',$id)->findAll();